package main

import "strings"

func Normalize(str string) string {
	return neologdReplacer.Replace(str)
}

func Clean(str string) string {
	return cleanReplacer.Replace(str)
}

const ProlongedSoundMark = '\u30FC'

var (
	cleanReplacer = strings.NewReplacer(
		"【", "", "】", "",
		"（", "", "）", "", "(", "", ")", "",
		"［", "", "］", "",
		"@", "", "＠", "",
	)

	// Copied from https://github.com/ikawaha/x/blob/master/neologd/neologd.go
	neologdReplacer = strings.NewReplacer(
		"０", "0", "１", "1", "２", "2", "３", "3", "４", "4",
		"５", "5", "６", "6", "７", "7", "８", "8", "９", "9",

		"Ａ", "A", "Ｂ", "B", "Ｃ", "C", "Ｄ", "D", "Ｅ", "E",
		"Ｆ", "F", "Ｇ", "G", "Ｈ", "H", "Ｉ", "I", "Ｊ", "J",
		"Ｋ", "K", "Ｌ", "L", "Ｍ", "M", "Ｎ", "N", "Ｏ", "O",
		"Ｐ", "P", "Ｑ", "Q", "Ｒ", "R", "Ｓ", "S", "Ｔ", "T",
		"Ｕ", "U", "Ｖ", "V", "Ｗ", "W", "Ｘ", "X", "Ｙ", "Y",
		"Ｚ", "Z",

		"ａ", "a", "ｂ", "b", "ｃ", "c", "ｄ", "d", "ｅ", "e",
		"ｆ", "f", "ｇ", "g", "ｈ", "h", "ｉ", "i", "ｊ", "j",
		"ｋ", "k", "ｌ", "l", "ｍ", "m", "ｎ", "n", "ｏ", "o",
		"ｐ", "p", "ｑ", "q", "ｒ", "r", "ｓ", "s", "ｔ", "t",
		"ｕ", "u", "ｖ", "v", "ｗ", "w", "ｘ", "x", "ｙ", "y",
		"ｚ", "z",

		//small case
		"ｧ", "ァ", "ｨ", "ィ", "ｩ", "ゥ", "ｪ", "ェ", "ｫ", "ォ",
		"ｬ", "ャ", "ｭ", "ュ", "ｮ", "ョ", "ｯ", "ッ",

		"ｱ", "ア", "ｲ", "イ", "ｳ", "ウ", "ｴ", "エ", "ｵ", "オ",
		"ｶﾞ", "ガ", "ｷﾞ", "ギ", "ｸﾞ", "グ", "ｹﾞ", "ゲ", "ｺﾞ", "ゴ",
		"ｶ", "カ", "ｷ", "キ", "ｸ", "ク", "ｹ", "ケ", "ｺ", "コ",
		"ｻﾞ", "ザ", "ｼﾞ", "ジ", "ｽﾞ", "ズ", "ｾﾞ", "ゼ", "ｿﾞ", "ゾ",
		"ｻ", "サ", "ｼ", "シ", "ｽ", "ス", "ｾ", "セ", "ｿ", "ソ",
		"ﾀﾞ", "ダ", "ﾁﾞ", "ヂ", "ﾂﾞ", "ヅ", "ﾃﾞ", "デ", "ﾄﾞ", "ド",
		"ﾀ", "タ", "ﾁ", "チ", "ﾂ", "ツ", "ﾃ", "テ", "ﾄ", "ト",
		"ﾅ", "ナ", "ﾆ", "ニ", "ﾇ", "ヌ", "ﾈ", "ネ", "ﾉ", "ノ",
		"ﾊﾞ", "バ", "ﾋﾞ", "ビ", "ﾌﾞ", "ブ", "ﾍﾞ", "ベ", "ﾎﾞ", "ボ",
		"ﾊﾟ", "パ", "ﾋﾟ", "ピ", "ﾌﾟ", "プ", "ﾍﾟ", "ペ", "ﾎﾟ", "ポ",
		"ﾊ", "ハ", "ﾋ", "ヒ", "ﾌ", "フ", "ﾍ", "ヘ", "ﾎ", "ホ",
		"ﾏ", "マ", "ﾐ", "ミ", "ﾑ", "ム", "ﾒ", "メ", "ﾓ", "モ",
		"ﾔ", "ヤ", "ﾕ", "ユ", "ﾖ", "ヨ",
		"ﾗ", "ラ", "ﾘ", "リ", "ﾙ", "ル", "ﾚ", "レ", "ﾛ", "ロ",
		"ﾜ", "ワ", "ｦ", "ヲ", "ﾝ", "ン",

		// hyphen
		"\u02D7", "-", "\u058A", "-", "\u2010", "-", "\u2011", "-", "\u2012", "-",
		"\u2013", "-", "\u2043", "-", "\u207B", "-", "\u208B", "-", "\u2212", "-",

		// bar
		"\u2014", string(ProlongedSoundMark), // エムダッシュ
		"\u2015", string(ProlongedSoundMark), // ホリゾンタルバー
		"\u2500", string(ProlongedSoundMark), // 横細罫線
		"\u2501", string(ProlongedSoundMark), // 横太罫線
		"\uFE63", string(ProlongedSoundMark), // SMALL HYPHEN-MINUS
		"\uFF0D", string(ProlongedSoundMark), // 全角ハイフンマイナス
		"\uFF70", string(ProlongedSoundMark), // 半角長音記号

		// remove tilde
		"~", "", "\u223C", "", "\u223E", "", "\u301C", "", "\u3030", "", "\uFF5E", "",

		// zen -> han
		"！", "!", "”", `"`, "＃", "#", "＄", "$", "％", "%",
		"＆", "&", `’`, `'`, "（", "(", "）", ")", "＊", "*",
		"＋", "+", "，", ",", "−", "-", "．", ".", "／", "/",
		"：", ":", "；", ";", "＜", "<", "＞", ">", "？", "?",
		"＠", "@", "［", "[", "￥", "\u00A5", "］", "]", "＾", "^",
		"＿", "_", "｀", "`", "｛", "{", "｜", "|", "｝", "}",
		"　", " ",

		// han -> zen
		"｡", "。", "､", "、", "･", "・", "=", "＝", "｢", "「", "｣", "」",
	)
)
